%%
%%长期预测计算部分代码
%导入各年龄城镇男性人口、城镇女性人口、农村男性人口、农村女性人口原始数据
mt1=xlsread('D:\math\bin\MATLAB人口问题大作业代码\mt.xls');%基于xls文件在电脑中的位置而定
wt1=xlsread('D:\math\bin\MATLAB人口问题大作业代码\wt.xls');
mc1=xlsread('D:\math\bin\MATLAB人口问题大作业代码\mc.xls');
wc1=xlsread('D:\math\bin\MATLAB人口问题大作业代码\wc.xls');


% mt1=xlsread('C:\Matlab Simulation\mt.xls');%基于xls文件在电脑中的位置而定
% wt1=xlsread('C:\Matlab Simulation\wt.xls');
% mc1=xlsread('C:\Matlab Simulation\mc.xls');
% wc1=xlsread('C:\Matlab Simulation\wc.xls');

%创建矩阵
z=zeros(90,39);
mt=[mt1,z];
wt=[wt1,z];
mc=[mc1,z];
wc=[wc1,z];

%开始运算
st1=109.69;%长期预测城镇出生人口性别比
sc1=112;%长期预测农村出生人口性别比

for t=2:1:40%长期预测时间为2012年-2050年

fpt=wt(15:49,t-1);
fpt=sum(fpt(:));%求上一年城市育龄人口


fpc=wc(15:49,t-1);
fpc=sum(fpc(:));%求上一年农村育龄人口

n=[mt(:,1),wt(:,1),mc(:,1),wc(:,1)];
n=sum(n(:));%求初始全国人口

mt(1,t)=fpt.*ft(t+15)./1000.*st1./(st1+100);%拟合生育率时从1995年开始，存在时间差，t须+15
%城镇1岁男性人口

for a=2:1:17
mt(a,t)=mt(a-1,t-1).*(1-(hmt2(a-1)./1000));
end
%城镇2-17岁男性人口

for a=60:1:89
mt(a,t)=mt(a-1,t-1).*(1-(hmt2(a-1)./1000));
end
%城镇60-89岁男性人口

for a=18:1:59
mt(a,t)=mt(a-1,t-1).*(1-(hmt2(a-1)./1000))+n.*(c2(t)-c2(t-1))./84;
end
%城镇18-59岁男性人口

mt(90,t)=mt(90,t-1).*(1-(hmt2(90)./1000))+mt(89,t-1).*(1-(hmt2(89)./1000));
%城镇90岁及以上男性人口

wt(1,t)=fpt.*ft(t+15)./1000.*100./(st1+100);%拟合生育率时从1995年开始，存在时间差，t须+15
%城镇1岁女性人口

for a=2:1:17
wt(a,t)=wt(a-1,t-1).*(1-(hwt2(a-1)./1000));
end
%城镇2-17岁女性人口

for a=60:1:89
wt(a,t)=wt(a-1,t-1).*(1-(hwt2(a-1)./1000));
end
%城镇60-89岁女性人口

for a=18:1:59
wt(a,t)=wt(a-1,t-1).*(1-(hwt2(a-1)./1000))+n.*(c2(t)-c2(t-1))./84;
end
%城镇18-59岁女性人口

wt(90,t)=wt(90,t-1).*(1-(hwt2(90)./1000))+wt(89,t-1).*(1-(hwt2(89)./1000));
%城镇90岁及以上女性人口

mc(1,t)=fpc.*fc(t+15)./1000.*sc1./(sc1+100);%拟合生育率时从1995年开始，存在时间差，t须+15
%农村1岁男性人口

for a=2:1:17
mc(a,t)=mc(a-1,t-1).*(1-(hmc2(a-1)./1000));
end
%农村2-17岁男性人口

for a=60:1:89
mc(a,t)=mc(a-1,t-1).*(1-(hmc2(a-1)./1000));
end
%农村60-89岁男性人口

for a=18:1:59
mc(a,t)=mc(a-1,t-1).*(1-(hmc2(a-1)./1000))-n.*(c2(t)-c2(t-1))./84;
end
%农村18-59岁男性人口

mc(90,t)=mc(90,t-1).*(1-(hmc2(90)./1000))+mc(89,t-1).*(1-(hmc2(89)./1000));
%农村90岁及以上男性人口

wc(1,t)=fpc.*fc(t+15)./1000.*100./(sc1+100);%拟合生育率时从1995年开始，存在时间差，t须+15
%农村1岁女性人口

for a=2:1:17
wc(a,t)=wc(a-1,t-1).*(1-(hwc2(a-1)./1000));
end
%农村2-17岁女性人口

for a=60:1:89
wc(a,t)=wc(a-1,t-1).*(1-(hwc2(a-1)./1000));
end
%农村60-89岁女性人口

for a=18:1:59
wc(a,t)=wc(a-1,t-1).*(1-(hwc2(a-1)./1000))-n.*(c2(t)-c2(t-1))./84;
end
%农村18-59岁女性人口

wc(90,t)=wc(90,t-1).*(1-(hwc2(90)./1000))+wc(89,t-1).*(1-(hwc2(89)./1000));
%农村90岁及以上女性人口

end